feizhoushaheiren/Others/stm32_project/6-4 编码器接口测速/Hardware/Encoder.c
#include "stm32f10x.h"                  // Device header

void Encoder_Init()
{
		//开启时钟
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3,ENABLE);
		
		//初始化GPIO
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	
		GPIO_InitTypeDef GPIO_InitStructure;
		GPIO_InitStructure.GPIO_Mode=GPIO_Mode_IPU ;
		GPIO_InitStructure.GPIO_Pin=GPIO_Pin_6| GPIO_Pin_7;
		GPIO_InitStructure.GPIO_Speed= GPIO_Speed_50MHz;
		GPIO_Init(GPIOA,&GPIO_InitStructure);

		//配置时基单元
		TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
		TIM_TimeBaseInitStructure.TIM_ClockDivision=TIM_CKD_DIV1;
		TIM_TimeBaseInitStructure.TIM_CounterMode=TIM_CounterMode_Up;
		//有一个数的偏差
		TIM_TimeBaseInitStructure.TIM_Period=65536-1;  //ARR
		TIM_TimeBaseInitStructure.TIM_Prescaler=1-1;  //PSC
		TIM_TimeBaseInitStructure.TIM_RepetitionCounter=0;
		TIM_TimeBaseInit(TIM3,&TIM_TimeBaseInitStructure);	
		
		TIM_ICInitTypeDef TIM_ICInitStructure;
		TIM_ICStructInit(&TIM_ICInitStructure);
		TIM_ICInitStructure.TIM_Channel = TIM_Channel_1;
		TIM_ICInitStructure.TIM_ICFilter = 0xF;
		TIM_ICInit(TIM3,&TIM_ICInitStructure);
		TIM_ICStructInit(&TIM_ICInitStructure);
		TIM_ICInitStructure.TIM_Channel = TIM_Channel_2;
		TIM_ICInitStructure.TIM_ICFilter = 0xF;
		
		TIM_EncoderInterfaceConfig(TIM3,TIM_EncoderMode_TI12,TIM_ICPolarity_Rising,TIM_ICPolarity_Rising);
		
		TIM_Cmd(TIM3,ENABLE);


}


uint16_t Encorder_Get(void)
{
	return TIM_GetCounter(TIM3);
}

